#!/bin/bash
echo "              Вариант 2                 "
echo "--------------Задание 1------------------"
echo "Скорость лодки в стоячей воде V км/ч, скорость течения реки U км/ч (U < V). 
Время движения лодки по озеру T1 ч, а по реке (против течения) - T2 ч. Определить путь S, пройденный лодкой."
echo ""
V=40
U=30
T1=100
T2=3
echo "V = ${V}км/ч; U = ${U}км/ч; T1 = ${T1}Ч; T2 = ${T2}ч"
V1=$(bc<<<"scale=3;$V-$U")
S1=$(bc<<<"scale=3;$T2*$V1")
S2=$(bc<<<"scale=3;$V*$T1")
S=$(bc<<<"scale=3;$S2+$S1")
echo "S = $S"
echo "--------------Задание 2------------------"
echo "Найти площадь кольца, внутренний радиус которого равен R1, а внешний радиус равен R2 (R1 < R2).
 В качестве значения Pi использовать 3.14."
echo ""
R1=50
R2=70
Pi=3.14
echo "R1 = ${R1}см; R2 = ${R2}см; Pi = ${Pi}"
L=$(bc<<<"scale=3;$R2*$R2")
R=$(bc<<<"scale=3;$R1*$R1")
S0=$(bc<<<"scale=3;$L-$R")
S=$(bc<<<"scale=3;$Pi*$S0")
echo "Ответ = $S"
echo "--------------Задание 3------------------"
echo "Найти периметр и площадь прямоугольного треугольника, если даны длины его катетов a и b."
echo ""
a=14
b=10
echo "a = ${a}см; b = ${b}см"
P=$(bc<<<"scale=3;0.5*$a*$b")
A1=$(bc<<<"scale=3;$a*$a")
A2=$(bc<<<"scale=3;$b*$b")
A3=$(bc<<<"scale=3;$A1+$A2")
S=$(bc<<<"scale=3;$A3+$a+$b")
echo "Ответ = $P, $S"